# AreDetailElements Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DetailElementOrderUtils..::..AreDetailElements Method
DetailElementOrderUtils Class See Also
---
Indicates whether the given elements are all detail elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool AreDetailElements(
	Document pDocument,
	View pDBView,
	ICollection<ElementId> detailElementIds
)
```

Visual Basic
---
```text
Public Shared Function AreDetailElements ( _
	pDocument As Document, _
	pDBView As View, _
	detailElementIds As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool AreDetailElements(
	Document^ pDocument,
	View^ pDBView,
	ICollection<ElementId^>^ detailElementIds
)
```

# ### Parameters
pDocument
    Type: Autodesk.Revit.DB..::..Document The document.
pDBView
    Type: Autodesk.Revit.DB..::..View The view.
detailElementIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The set of detail elementIds to check.
# ### Return Value
True if it is a set of detail elements, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace